In [1]:
import pandas as pd
import numpy as np
from multiprocessing import Pool
from functools import partial
import Preprocess_func as func
from tqdm import tqdm_notebook as tqdm
from datetime import date, timedelta

Preprocess asset data year by year

In [5]:
df = pd.read_csv(r'D:\Customer_Value\data\st_trading.csv')

In [6]:
max_date = df['MTH_DATE'].max()

In [3]:
id_list = df['S_IDNO'].unique().tolist()

In [7]:
del df

In [9]:
asset = pd.read_csv(r'D:\Customer_Value\data\st_asset7.csv')

In [10]:
asset1 = asset.iloc[:35000000]
asset2 = asset.iloc[35000000:70000000]
asset3 = asset.iloc[70000000:]

In [11]:
del asset

In [16]:
asset1[['S_IDNO', 'MTH_DATE', 'ST_ASSET', 'MP_ASSET']] = asset1.iloc[:, 0].str.split(expand=True, n=3)
asset1 = asset1.iloc[:, 1:]
asset1 = asset1[asset1.MTH_DATE <= max_date]
asset1 = asset1[asset1.S_IDNO.isin(id_list)]
asset1[['MP_ASSET', 'SS_ASSET']] = asset1['MP_ASSET'].str.split(expand=True, n=1)

In [17]:
asset1

             S_IDNO    MTH_DATE  ST_ASSET MP_ASSET SS_ASSET
1        A100000136  2019-01-02   1306090        0        0
5        A100001259  2019-01-02    722227        0        0
9        A100002167  2019-01-02     16100        0        0
17       A100006576  2019-01-02   1095980        0        0
18       A100006601  2019-01-02         0        0        0
...             ...         ...       ...      ...      ...
9420843  Z200135119  2019-02-12   1795233        0        0
9420845  Z200136661  2019-02-12   2325496        0        0
9420846  Z200136876  2019-02-12  12290023        0        0
9420847  Z200145633  2019-02-12    155200        0        0
9420848  Z221929111  2019-02-12     73503        0        0

[4605955 rows x 5 columns]

In [18]:
asset1.to_csv(r'D:\Customer_Value\data\st_asset7_processed.csv', index=False)

In [15]:
del asset3

In [2]:
asset1 = pd.read_csv(r'D:\Customer_Value\data\st_asset7_processed1.csv')
asset2 = pd.read_csv(r'D:\Customer_Value\data\st_asset7_processed2.csv')
asset3 = pd.read_csv(r'D:\Customer_Value\data\st_asset7_processed3.csv')

In [3]:
asset = pd.concat([asset1, asset2, asset3], axis=0)

In [4]:
asset.to_csv(r'D:\Customer_Value\data\st_asset7_processed.csv', index=False)

In [5]:
asset

              S_IDNO    MTH_DATE  ST_ASSET  MP_ASSET  SS_ASSET
0         A100000136  2018-01-02   1599700         0         0
1         A100001259  2018-01-02    213626         0         0
2         A100002167  2018-01-02    279500         0         0
3         A100006576  2018-01-02   1433470         0         0
4         A100006601  2018-01-02         0         0         0
...              ...         ...       ...       ...       ...
14997027  Z200135119  2018-12-28   1711329         0         0
14997028  Z200136661  2018-12-28   2188554         0         0
14997029  Z200136876  2018-12-28  12235990         0         0
14997030  Z200145633  2018-12-28    157600         0         0
14997031  Z221929111  2018-12-28     69897         0         0

[49218547 rows x 5 columns]